// import data from '../data/app.json';

$(function () {

    const mapinfo = [
        {
            "city": "서울",
            "subcity": [
                {
                    "name": "논현점",
                    "mapinfo": [
                        "37.5160790812474",
                        "127.020346472276"
                    ]
                },
                {
                    "name": "삼성점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "강남점",
                    "mapinfo": [
                        "37.4977701156608",
                        "127.02786445383165"
                    ]
                },
                {
                    "name": "잠실점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "종로점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "관악봉천점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "신길점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "가산점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "상봉점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "구로점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "양천점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "신림점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "이수점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "신촌점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                }
            ]
        },
        {
            "city": "경기도",
            "subcity": [
                {
                    "name": "성남점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "평택점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "수원점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "용인점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "화성점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "안성점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "광주점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                }
            ]
        },
        {
            "city": "강원도",
            "subcity": [
                {
                    "name": "강릉점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "속초점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "양양점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "평창점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "양구점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "인제점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "춘천점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                }
            ]
        },
        {
            "city": "충청도",
            "subcity": [
                {
                    "name": "천안점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "아산점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "논산점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "충주점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "대전점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "공주점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "보령점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                }
            ]
        },
        {
            "city": "경상북도",
            "subcity": [
                {
                    "name": "문경점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "상주점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "구미점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "포항점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "안동점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "경주점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "김천점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                }
            ]
        },
        {
            "city": "경상남도",
            "subcity": [
                {
                    "name": "창원점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "진주점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "거제점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "부산점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "김해점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "양산점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "밀양점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "남해점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                }
            ]
        },
        {
            "city": "전라북도",
            "subcity": [
                {
                    "name": "익산점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "전주점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "군산점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "부산점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "남원점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "정읍점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "고창점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "김제점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                }
            ]
        },
        {
            "city": "전라남도",
            "subcity": [
                {
                    "name": "목포점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "나주점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "영광점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "광양점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "여수점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "해남점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "광주점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "고흥점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                }
            ]
        },
        {
            "city": "제주도",
            "subcity": [
                {
                    "name": "제주점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
                {
                    "name": "서귀포점",
                    "mapinfo": [
                        "37.507992111879894",
                        "127.06283928846423"
                    ]
                },
            ]
        }

    ]

    var cityinfo = "";
    var subcityinfo = "";
    var infonum = 0;
    for (x in mapinfo) {
        cityinfo += `<li class='col-4'>${mapinfo[x].city}</li>`;

    }

    $(".citynm").html(cityinfo);


    $("#addressMap .secondad").on('click', 'li', function () {
        $(this).toggleClass("on").siblings().removeClass("on") //제이쿼리 동적 개체 , 정적개체 봐야함
    })


    $(".citynm>li").click(function () {
        $(this).toggleClass("on").siblings().removeClass("on");

        subcityinfo = "";
        for (j in mapinfo[$(this).index()].subcity) {
            subcityinfo += `<li class='col-3'>${mapinfo[$(this).index()].subcity[j].name}</li>`;
        }
        $(".subnm").html(subcityinfo);
    })


    const btnnm = ["Mini", "Small", "Medium", "Large"]
    const swiper = new Swiper("#sizeBanner .swiper", {
        loop: true,
        spaceBetween: 30,
        effect: "fade",
        autoplay: {
            delay: 4000,
        },
        pagination: {
            el: "#sizeBanner .swiper-pagination",
            clickable: true,
            renderBullet: function (index, className) {
                return '<span class="' + className + '">' + btnnm[index] + "</span>";
            },
        },
        navigation: {
            nextEl: "#sizeBanner .swiper-button-next",
            prevEl: "#sizeBanner .swiper-button-prev",
        },
    })
})
